[
    {
        "bookId": 1,
        "bookName": "1984",
        "author": "George Orwell",
        "image": "/images/1.jpg",
        "review": " A gripping dystopian novel that depicts a totalitarian society ruled by Big Brother, where individuality is suppressed, and government surveillance is pervasive. The story follows Winston Smith's rebellion against the oppressive regime, exploring themes of power, manipulation, and the erosion of personal freedom. Orwell's prophetic vision serves as a stark warning about the dangers of authoritarianism and the manipulation of truth for political purposes. 1984 remains a timeless classic that prompts readers to reflect on the fragility of democracy and the importance of preserving individual liberties",
        "totalPages": 328,
        "rating": 4.5,
        "category": "Fiction",
        "tags": [
            "Dystopian",
            "Political"
        ],
        "publisher": "Secker & Warburg",
        "yearOfPublishing": 1949
    },
    {
        "bookId": 2,
        "bookName": "To Kill a Mockingbird",
        "author": "Harper Lee",
        "image": "/images/2.jpeg",
        "review": "To Kill a Mockingbird by Harper Lee is a classic novel set in the racially segregated South during the 1930s. Narrated by young Scout Finch, the story revolves around her father, Atticus Finch, defending Tom Robinson, a black man falsely accused of rape. Through Scout's eyes, readers witness the deep-seated prejudice and injustice prevalent in their community. The novel explores themes of racial inequality, morality, and the loss of innocence as Scout and her brother, Jem, come of age. Despite facing opposition, Atticus serves as a moral beacon, teaching his children the importance of empathy and standing up for what is right. To Kill a Mockingbird remains a timeless portrayal of the human condition and the enduring struggle for justice and equality.",
        "totalPages": 281,
        "rating": 4.8,
        "category": "Fiction",
        "tags": [
            "Classic",
            "Coming-of-age"
        ],
        "publisher": "J. B. Lippincott & Co.",
        "yearOfPublishing": 1960
    },
    {
        "bookId": 3,
        "bookName": "The Great Gatsby",
        "author": "F. Scott Fitzgerald",
        "image": "/images/3.jpeg",
        "review": " A timeless tale set in the Roaring Twenties, following the enigmatic Jay Gatsby's pursuit of the American Dream. Narrated by Nick Carraway, the story explores themes of love, ambition, and the emptiness of materialism. Against the backdrop of lavish parties and societal decadence, Fitzgerald paints a vivid portrait of the Jazz Age, highlighting the moral decay lurking beneath the veneer of wealth. Through Gatsby's unrequited love for Daisy Buchanan and the allure of the unattainable, the novel delves into the complexities of human nature and the quest for self-identity. With evocative prose and timeless themes, The Great Gatsby remains a profound exploration of the human condition, captivating readers across generations.",
        "totalPages": 218,
        "rating": 4.6,
        "category": "Fiction",
        "tags": [
            "Classic",
            "Romance"
        ],
        "publisher": "Charles Scribner's Sons",
        "yearOfPublishing": 1925
    },
    {
        "bookId": 4,
        "bookName": "Sapiens: A Brief History of Humankind",
        "author": "Yuval Noah Harari",
        "image": "/images/4.jpg",
        "review": "Sapiens: A Brief History of Humankind by Yuval Noah Harari provides a comprehensive overview of the evolution of Homo sapiens, tracing their journey from ancient times to the modern era. Through a concise and engaging narrative, Harari explores significant milestones such as the Cognitive and Agricultural Revolutions, examining how these developments have shaped human societies, cultures, and civilizations. The book offers thought-provoking insights into various aspects of human existence, including social structures, belief systems, and technological advancements, inviting readers to contemplate the trajectory of human history and the implications for our future. Overall, Sapiens offers a compelling synthesis of anthropology, history, and evolutionary biology, making it an enlightening and accessible read for anyone interested in understanding the story of humanity.",
        "totalPages": 443,
        "rating": 4.7,
        "category": "Non-fiction",
        "tags": [
            "History",
            "Anthropology"
        ],
        "publisher": "Harper",
        "yearOfPublishing": 2011
    },
    {
        "bookId": 5,
        "bookName": "The Catcher in the Rye",
        "author": "J.D. Salinger",
        "image": "/images/5.jpeg",
        "review": "The Catcher in the Rye by J.D. Salinger is a coming-of-age novel that follows the disillusioned teenager Holden Caulfield over a few days in New York City. Throughout the story, Holden grapples with themes of alienation, identity, and the loss of innocence as he navigates encounters with various characters and reflects on his past experiences. The novel is renowned for its authentic portrayal of adolescent angst and its exploration of the challenges of growing up in a world that Holden perceives as phony and hypocritical. Through Holden's cynical yet introspective narration, readers are invited to contemplate universal questions about authenticity, belonging, and the complexities of human relationships. The Catcher in the Rye continues to resonate with readers of all ages, making it a timeless classic in American literature.",
        "totalPages": 277,
        "rating": 4.4,
        "category": "Fiction",
        "tags": [
            "Classic",
            "Coming-of-age"
        ],
        "publisher": "Little, Brown and Company",
        "yearOfPublishing": 1951
    },
    {
        "bookId": 6,
        "bookName": "The Hitchhiker's Guide to the Galaxy",
        "author": "Douglas Adams",
        "image": "/images/6.jpg",
        "review": "The Hitchhiker's Guide to the Galaxy by Douglas Adams is a comedic science fiction novel following the bewildering adventures of Arthur Dent, a hapless human, and his eccentric alien friend Ford Prefect after Earth's sudden destruction. Armed with the Hitchhiker's Guide, a whimsically unreliable travel manual, they journey across the galaxy, encountering bizarre creatures and improbable scenarios. Along the way, they meet peculiar characters like the ex-President of the Galaxy, Zaphod Beeblebrox, and the perpetually pessimistic robot, Marvin. Through its absurd humor and witty satire, the novel explores themes of existentialism, the absurdity of life, and the quest for meaning in an infinitely vast universe.",
        "totalPages": 193,
        "rating": 4.3,
        "category": "Fiction",
        "tags": [
            "Science Fiction",
            "Humor"
        ],
        "publisher": "Pan Books",
        "yearOfPublishing": 1979
    }
]